ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTsurugi/pins_arduino.h
/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN18  ADC_CH(18)
#define AIN19  ADC_CH(19)
#define AIN20  ADC_CH(20)
#define AIN21  ADC_CH(21)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

/* ---- Pin arrays (ARDUINO_MAIN). Indexed by digital pin number (0..24). ---- */
#ifdef ARDUINO_MAIN
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA5  D0  RX/USART0 RX
    PA,         //  1 PA4  D1  TX/USART0 TX
    PA,         //  2 PA7  D2  USART0 XDIR / AC0 OUT / EVOUTA
    PA,         //  3 PA6  D3  TCB1 PWM via CCL LUT0
    PF,         //  4 PF4  D4
    PD,         //  5 PD0  D5  TCA0 WO0
    PD,         //  6 PD1  D6  TCA0 WO1
    PC,         //  7 PC3  D7
    PF,         //  8 PF5  D8
    PD,         //  9 PD2  D9  TCA0 WO2
    PD,         // 10 PD3  D10 TCA0 WO3 / SS
    PD,         // 11 PD4  D11 TCA0 WO4 / MOSI
    PD,         // 12 PD5  D12 TCA0 WO5 / MISO
    PD,         // 13 PD6  D13 SCK / LED_BUILTIN
    PF,         // 14 PF0  A0
    PF,         // 15 PF1  A1
    PF,         // 16 PF2  A2
    PF,         // 17 PF3  A3
    PA,         // 18 PA2  A4 / SDA
    PA,         // 19 PA3  A5 / SCL
    PD,         // 20 PD7  AREF (VREFA)
    PA,         // 21 PA0  XTALHF1
    PA,         // 22 PA1  XTALHF2
    PF,         // 23 PF6  RESET
    PF          // 24 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_position[] = {
    PIN5_bp,   //  0 PA5  D0
    PIN4_bp,   //  1 PA4  D1
    PIN7_bp,   //  2 PA7  D2
    PIN6_bp,   //  3 PA6  D3
    PIN4_bp,   //  4 PF4  D4
    PIN0_bp,   //  5 PD0  D5
    PIN1_bp,   //  6 PD1  D6
    PIN3_bp,   //  7 PC3  D7
    PIN5_bp,   //  8 PF5  D8
    PIN2_bp,   //  9 PD2  D9
    PIN3_bp,   // 10 PD3  D10
    PIN4_bp,   // 11 PD4  D11
    PIN5_bp,   // 12 PD5  D12
    PIN6_bp,   // 13 PD6  D13
    PIN0_bp,   // 14 PF0  A0
    PIN1_bp,   // 15 PF1  A1
    PIN2_bp,   // 16 PF2  A2
    PIN3_bp,   // 17 PF3  A3
    PIN2_bp,   // 18 PA2  A4
    PIN3_bp,   // 19 PA3  A5
    PIN7_bp,   // 20 PD7  AREF
    #if ((CLOCK_SOURCE & 0x03) == 0) // internal clock -> PA0 is a usable GPIO
      PIN0_bp, // 21 PA0
    #else                            // external crystal/clock -> PA0 = XTALHF1
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1) // external crystal also takes PA1
      NOT_A_PIN,
    #else
      PIN1_bp, // 22 PA1
    #endif
    PIN6_bp,   // 23 PF6 RESET
    PIN7_bp    // 24 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN5_bm,   //  0 PA5  D0
    PIN4_bm,   //  1 PA4  D1
    PIN7_bm,   //  2 PA7  D2
    PIN6_bm,   //  3 PA6  D3
    PIN4_bm,   //  4 PF4  D4
    PIN0_bm,   //  5 PD0  D5
    PIN1_bm,   //  6 PD1  D6
    PIN3_bm,   //  7 PC3  D7
    PIN5_bm,   //  8 PF5  D8
    PIN2_bm,   //  9 PD2  D9
    PIN3_bm,   // 10 PD3  D10
    PIN4_bm,   // 11 PD4  D11
    PIN5_bm,   // 12 PD5  D12
    PIN6_bm,   // 13 PD6  D13
    PIN0_bm,   // 14 PF0  A0
    PIN1_bm,   // 15 PF1  A1
    PIN2_bm,   // 16 PF2  A2
    PIN3_bm,   // 17 PF3  A3
    PIN2_bm,   // 18 PA2  A4
    PIN3_bm,   // 19 PA3  A5
    PIN7_bm,   // 20 PD7  AREF
    #if ((CLOCK_SOURCE & 0x03) == 0)
      PIN0_bm, // 21 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)
      NOT_A_PIN,
    #else
      PIN1_bm, // 22 PA1
    #endif
    PIN6_bm,   // 23 PF6 RESET
    PIN7_bm    // 24 PF7 UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. D3 (PA6) is marked TIMERB1: it carries TCB1's PWM through CCL LUT0
   * (see WAZAMONO_TCB1_LUTPWM_* above). millis = TCB0. */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA5  D0
    NOT_ON_TIMER, //  1 PA4  D1
    NOT_ON_TIMER, //  2 PA7  D2
    TIMERB1,      //  3 PA6  D3  (TCB1 PWM delivered via CCL LUT0)
    NOT_ON_TIMER, //  4 PF4  D4  (no PWM: TCB0 = millis)
    NOT_ON_TIMER, //  5 PD0  D5  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PD1  D6  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  7 PC3  D7
    NOT_ON_TIMER, //  8 PF5  D8  (TCB1 WO parked here; not a PWM pin)
    NOT_ON_TIMER, //  9 PD2  D9  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_ON_TIMER, // 11 PD4  D11 (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 12 PD5  D12 (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 13 PD6  D13
    NOT_ON_TIMER, // 14 PF0  A0
    NOT_ON_TIMER, // 15 PF1  A1
    NOT_ON_TIMER, // 16 PF2  A2
    NOT_ON_TIMER, // 17 PF3  A3
    NOT_ON_TIMER, // 18 PA2  A4
    NOT_ON_TIMER, // 19 PA3  A5
    NOT_ON_TIMER, // 20 PD7  AREF
    NOT_ON_TIMER, // 21 PA0
    NOT_ON_TIMER, // 22 PA1
    NOT_ON_TIMER, // 23 PF6 RESET
    NOT_ON_TIMER  // 24 PF7 UPDI
  };
#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part, treated like the 32U4)
 * =================================================================
 *  USBCON enables Arduino's HID / Keyboard / Mouse / etc. on this board.
 *  NOTE: the native USB-CDC descriptor's VID/PID/product string are taken
 *  from cores/dxcore/usb_descriptors.{h,c} (which does NOT include this
 *  file), so the values below are informational only - keep them in sync.
 *  Effective app identity: 0x1209:0x0008, product "Wazamono Tsurugi".
 *  Obtain a real product VID/PID before release (pid.codes = dev only).
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x0008
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "Workshop Asahi"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "Wazamono Tsurugi"
#endif

/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART0   (D0/D1, ALT1 - the Uno R3 hardware UART; Uno R4 naming.
 *                      Alias of Serial0 - both names reach the same port.)
 *  USART1  = compiled out (WAZAMONO_NO_USART1: no usable pins on Tsurugi).
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* Uno R3 D0/D1 hardware UART (USART0) */
  #endif
#endif

/* ---- analogReference(EXTERNAL) is available: PD7 (VREFA) is wired to the
 * AREF header pin (index 20; no Dn alias), exactly like the Uno R3. ---- */

#endif
